/*Запустите цикл, в котором пользователю предлагается вводить число с клавиатуры, до тех пор, пока не будет введена пустая строка или 0. После выхода из цикла выведите общую сумму и среднее арифметическое введённых чисел. Если пользователь ввел не число, то вывести сообщение об ошибке ввода. При подсчете учесть, что пользователь может ввести отрицательное значение.*/


for (;;) {
    a = prompt("введите число");
    b += a;
    if (a = 0){

        console.log(b);
        break;
    }
}

console.log(b);